makuo:yolo-keras-face-detection abars$ python agegender_train.py 
INFO:plaidml:Opening device "amd_radeon_hd_-_firepro_d300_compute_engine.1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
image_array (Conv2D)         (None, 64, 64, 16)        2368      
_________________________________________________________________
batch_normalization_1 (Batch (None, 64, 64, 16)        64        
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 64, 64, 16)        12560     
_________________________________________________________________
batch_normalization_2 (Batch (None, 64, 64, 16)        64        
_________________________________________________________________
activation_1 (Activation)    (None, 64, 64, 16)        0         
_________________________________________________________________
average_pooling2d_1 (Average (None, 32, 32, 16)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 32, 32, 16)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 32, 32)        12832     
_________________________________________________________________
batch_normalization_3 (Batch (None, 32, 32, 32)        128       
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 32, 32, 32)        25632     
_________________________________________________________________
batch_normalization_4 (Batch (None, 32, 32, 32)        128       
_________________________________________________________________
activation_2 (Activation)    (None, 32, 32, 32)        0         
_________________________________________________________________
average_pooling2d_2 (Average (None, 16, 16, 32)        0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 16, 16, 64)        18496     
_________________________________________________________________
batch_normalization_5 (Batch (None, 16, 16, 64)        256       
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 16, 16, 64)        36928     
_________________________________________________________________
batch_normalization_6 (Batch (None, 16, 16, 64)        256       
_________________________________________________________________
activation_3 (Activation)    (None, 16, 16, 64)        0         
_________________________________________________________________
average_pooling2d_3 (Average (None, 8, 8, 64)          0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 8, 8, 128)         73856     
_________________________________________________________________
batch_normalization_7 (Batch (None, 8, 8, 128)         512       
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 8, 8, 128)         147584    
_________________________________________________________________
batch_normalization_8 (Batch (None, 8, 8, 128)         512       
_________________________________________________________________
activation_4 (Activation)    (None, 8, 8, 128)         0         
_________________________________________________________________
average_pooling2d_4 (Average (None, 4, 4, 128)         0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 4, 4, 256)         295168    
_________________________________________________________________
batch_normalization_9 (Batch (None, 4, 4, 256)         1024      
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 4, 4, 16)          36880     
_________________________________________________________________
global_average_pooling2d_1 ( (None, 16)                0         
_________________________________________________________________
predictions (Activation)     (None, 16)                0         
=================================================================
Total params: 665,248
Trainable params: 663,776
Non-trainable params: 1,472
_________________________________________________________________
Found 8617 images belonging to 16 classes.
Found 2872 images belonging to 16 classes.
Epoch 1/50
INFO:plaidml:Analyzing Ops: 148 of 1198 operations complete
INFO:plaidml:Analyzing Ops: 345 of 1198 operations complete
INFO:plaidml:Analyzing Ops: 439 of 1198 operations complete
INFO:plaidml:Analyzing Ops: 595 of 1198 operations complete
538/679 [======================>.......] - ETA: 59s - loss: 2.7021 - acc: 0.1866INFO:plaidml:Analyzing Ops: 137 of 1198 operations complete
INFO:plaidml:Analyzing Ops: 299 of 1198 operations complete
INFO:plaidml:Analyzing Ops: 424 of 1198 operations complete
INFO:plaidml:Analyzing Ops: 510 of 1198 operations complete
INFO:plaidml:Analyzing Ops: 595 of 1198 operations complete
678/679 [============================>.] - ETA: 0s - loss: 2.6616 - acc: 0.1920INFO:plaidml:Analyzing Ops: 118 of 218 operations complete
INFO:plaidml:Analyzing Ops: 135 of 219 operations complete
679/679 [==============================] - 393s - loss: 2.6611 - acc: 0.1919 - val_loss: 2.5279 - val_acc: 0.2151
Epoch 2/50
679/679 [==============================] - 272s - loss: 2.4237 - acc: 0.2253 - val_loss: 2.3488 - val_acc: 0.2231
Epoch 3/50
679/679 [==============================] - 281s - loss: 2.3293 - acc: 0.2490 - val_loss: 2.2269 - val_acc: 0.2910
Epoch 4/50
679/679 [==============================] - 286s - loss: 2.2369 - acc: 0.2822 - val_loss: 2.0809 - val_acc: 0.3247
Epoch 5/50
679/679 [==============================] - 283s - loss: 2.1555 - acc: 0.2986 - val_loss: 1.9913 - val_acc: 0.3559
Epoch 6/50
679/679 [==============================] - 286s - loss: 2.0914 - acc: 0.3179 - val_loss: 2.0881 - val_acc: 0.3240
Epoch 7/50
679/679 [==============================] - 282s - loss: 2.0456 - acc: 0.3277 - val_loss: 1.9211 - val_acc: 0.3667
Epoch 8/50
679/679 [==============================] - 283s - loss: 2.0134 - acc: 0.3426 - val_loss: 1.8216 - val_acc: 0.4064
Epoch 9/50
679/679 [==============================] - 276s - loss: 1.9715 - acc: 0.3505 - val_loss: 1.8050 - val_acc: 0.4072
Epoch 10/50
679/679 [==============================] - 277s - loss: 1.9562 - acc: 0.3542 - val_loss: 1.8815 - val_acc: 0.3692
Epoch 11/50
679/679 [==============================] - 269s - loss: 1.9117 - acc: 0.3655 - val_loss: 1.7817 - val_acc: 0.4058
Epoch 12/50
679/679 [==============================] - 267s - loss: 1.8970 - acc: 0.3700 - val_loss: 1.7051 - val_acc: 0.4247
Epoch 13/50
679/679 [==============================] - 268s - loss: 1.8640 - acc: 0.3784 - val_loss: 1.7563 - val_acc: 0.4080
Epoch 14/50
679/679 [==============================] - 266s - loss: 1.8658 - acc: 0.3754 - val_loss: 1.7238 - val_acc: 0.4205
Epoch 15/50
679/679 [==============================] - 266s - loss: 1.8504 - acc: 0.3814 - val_loss: 1.6797 - val_acc: 0.4296
Epoch 16/50
679/679 [==============================] - 266s - loss: 1.8368 - acc: 0.3897 - val_loss: 1.6811 - val_acc: 0.4169
Epoch 17/50
679/679 [==============================] - 266s - loss: 1.8057 - acc: 0.3946 - val_loss: 1.6345 - val_acc: 0.4435
Epoch 18/50
679/679 [==============================] - 267s - loss: 1.8013 - acc: 0.3977 - val_loss: 1.5958 - val_acc: 0.4540
Epoch 19/50
679/679 [==============================] - 275s - loss: 1.7888 - acc: 0.4010 - val_loss: 1.6100 - val_acc: 0.4523
Epoch 20/50
679/679 [==============================] - 274s - loss: 1.7728 - acc: 0.4052 - val_loss: 1.6045 - val_acc: 0.4564
Epoch 21/50
679/679 [==============================] - 276s - loss: 1.7617 - acc: 0.4054 - val_loss: 1.6131 - val_acc: 0.4457
Epoch 22/50
679/679 [==============================] - 273s - loss: 1.7653 - acc: 0.4045 - val_loss: 1.5385 - val_acc: 0.4620
Epoch 23/50
679/679 [==============================] - 267s - loss: 1.7518 - acc: 0.4096 - val_loss: 1.5937 - val_acc: 0.4564
Epoch 24/50
679/679 [==============================] - 267s - loss: 1.7391 - acc: 0.4132 - val_loss: 1.5541 - val_acc: 0.4648
Epoch 25/50
679/679 [==============================] - 267s - loss: 1.7302 - acc: 0.4159 - val_loss: 1.5501 - val_acc: 0.4593
Epoch 26/50
679/679 [==============================] - 269s - loss: 1.7416 - acc: 0.4132 - val_loss: 1.5682 - val_acc: 0.4526
Epoch 27/50
679/679 [==============================] - 268s - loss: 1.7113 - acc: 0.4225 - val_loss: 1.5489 - val_acc: 0.4656
Epoch 28/50
679/679 [==============================] - 269s - loss: 1.7110 - acc: 0.4274 - val_loss: 1.5202 - val_acc: 0.4789
Epoch 29/50
679/679 [==============================] - 268s - loss: 1.7025 - acc: 0.4232 - val_loss: 1.5116 - val_acc: 0.4848
Epoch 30/50
679/679 [==============================] - 270s - loss: 1.7064 - acc: 0.4189 - val_loss: 1.4995 - val_acc: 0.4825
Epoch 31/50
679/679 [==============================] - 274s - loss: 1.7016 - acc: 0.4210 - val_loss: 1.5135 - val_acc: 0.4767
Epoch 32/50
679/679 [==============================] - 275s - loss: 1.6828 - acc: 0.4356 - val_loss: 1.5466 - val_acc: 0.4642
Epoch 33/50
679/679 [==============================] - 269s - loss: 1.6716 - acc: 0.4370 - val_loss: 1.4974 - val_acc: 0.4903
Epoch 34/50
679/679 [==============================] - 270s - loss: 1.6799 - acc: 0.4278 - val_loss: 1.4703 - val_acc: 0.4867
Epoch 35/50
679/679 [==============================] - 266s - loss: 1.6646 - acc: 0.4332 - val_loss: 1.4718 - val_acc: 0.4975
Epoch 36/50
679/679 [==============================] - 265s - loss: 1.6662 - acc: 0.4314 - val_loss: 1.4845 - val_acc: 0.4823
Epoch 37/50
679/679 [==============================] - 266s - loss: 1.6630 - acc: 0.4346 - val_loss: 1.4713 - val_acc: 0.4892
Epoch 38/50
679/679 [==============================] - 266s - loss: 1.6568 - acc: 0.4440 - val_loss: 1.4495 - val_acc: 0.4945
Epoch 39/50
679/679 [==============================] - 266s - loss: 1.6499 - acc: 0.4428 - val_loss: 1.4486 - val_acc: 0.4947
Epoch 40/50
679/679 [==============================] - 266s - loss: 1.6389 - acc: 0.4434 - val_loss: 1.4700 - val_acc: 0.4881
Epoch 41/50
679/679 [==============================] - 265s - loss: 1.6513 - acc: 0.4414 - val_loss: 1.4449 - val_acc: 0.5003
Epoch 42/50
679/679 [==============================] - 266s - loss: 1.6255 - acc: 0.4531 - val_loss: 1.4324 - val_acc: 0.5008
Epoch 43/50
679/679 [==============================] - 266s - loss: 1.6484 - acc: 0.4450 - val_loss: 1.4264 - val_acc: 0.5022
Epoch 44/50
679/679 [==============================] - 266s - loss: 1.6409 - acc: 0.4441 - val_loss: 1.4391 - val_acc: 0.5072
Epoch 45/50
679/679 [==============================] - 271s - loss: 1.6328 - acc: 0.4468 - val_loss: 1.4598 - val_acc: 0.4978
Epoch 46/50
679/679 [==============================] - 272s - loss: 1.6156 - acc: 0.4499 - val_loss: 1.4002 - val_acc: 0.5167
Epoch 47/50
679/679 [==============================] - 269s - loss: 1.6169 - acc: 0.4462 - val_loss: 1.4117 - val_acc: 0.5030
Epoch 48/50
679/679 [==============================] - 266s - loss: 1.6007 - acc: 0.4524 - val_loss: 1.4194 - val_acc: 0.5105
Epoch 49/50
679/679 [==============================] - 265s - loss: 1.6016 - acc: 0.4544 - val_loss: 1.4241 - val_acc: 0.5155
Epoch 50/50
679/679 [==============================] - 265s - loss: 1.5995 - acc: 0.4514 - val_loss: 1.4388 - val_acc: 0.5036
makuo:yolo-keras-face-detection abars$ 
